ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_LPC546XX/drivers/fsl_enet.c
    if (mask & kENET_MacTimestamp) {
        dummy = base->MAC_SYS_TIMESTMP_STAT;
    } else if (mask & kENET_MacPmt) {
        dummy = base->MAC_PMT_CRTL_STAT;
    } else {
        /* Add for avoid the misra 2004 rule 14.10 */
    }
    (void)dummy;
}

void ENET_DisableInterrupts(ENET_Type *base, uint32_t mask)
{
    uint32_t interrupt = mask & 0xFFFFU;
    uint8_t index;

    /* For dma interrupt. */
    if (interrupt) {
        for (index = 0; index < ENET_RING_NUM_MAX; index++) {
            /* Set for all abnormal interrupts. */
            if (ENET_ABNORM_INT_MASK & interrupt) {
                interrupt |= ENET_DMA_CH_DMA_CHX_INT_EN_AIE_MASK;
            }
            /* Set for all normal interrupts. */
            if (ENET_NORM_INT_MASK & interrupt) {
                interrupt |= ENET_DMA_CH_DMA_CHX_INT_EN_NIE_MASK;
            }
            base->DMA_CH[index].DMA_CHX_INT_EN &= ~interrupt;
        }
    }
    interrupt = interrupt >> ENET_MACINT_ENUM_OFFSET;
    if (interrupt) {
        /* MAC interrupt */
        base->MAC_INTR_EN &= ~interrupt;
    }
}

void ENET_CreateHandler(ENET_Type *base,
                        enet_handle_t *handle,
                        enet_config_t *config,
                        enet_buffer_config_t *bufferConfig,
                        enet_callback_t callback,
                        void *userData)
{
    assert(config);
    assert(bufferConfig);
    assert(callback);

    uint8_t ringNum = 1;
    uint8_t count = 0;
    uint8_t rxIntEnable = 0;
    enet_buffer_config_t *buffConfig = bufferConfig;

    if (config->multiqueueCfg) {
        ringNum = 2;
        handle->multiQueEnable = true;
    }

    /* Store transfer parameters in handle pointer. */
    memset(handle, 0, sizeof(enet_handle_t));
    if (config->specialControl & kENET_DescDoubleBuffer) {
        handle->doubleBuffEnable = true;
    }
    if (config->multiqueueCfg) {
        handle->multiQueEnable = true;
    }
    for (count = 0; count < ringNum; count++) {
        handle->rxBdRing[count].rxBdBase = buffConfig->rxDescStartAddrAlign;
        handle->rxBdRing[count].rxGenIdx = 0;
        handle->rxBdRing[count].rxRingLen = buffConfig->rxRingLen;
        handle->rxBdRing[count].rxBuffSizeAlign = buffConfig->rxBuffSizeAlign;

        handle->txBdRing[count].txBdBase = buffConfig->txDescStartAddrAlign;
        handle->txBdRing[count].txRingLen = buffConfig->txRingLen;
        handle->txBdRing[count].txGenIdx = 0;
        handle->txBdRing[count].txConsumIdx = 0;
        handle->txBdRing[count].txDescUsed = 0;
#ifdef ENET_PTP1588FEATURE_REQUIRED
        assert(bufferConfig->rxPtpTsData);
        assert(bufferConfig->txPtpTsData);
        assert(buffConfig->rxRingLen <= ENET_RXBUFFSTORE_NUM);

        uint32_t index;

        handle->rxBdRing[count].rxPtpTsDataRing.ptpTsData = buffConfig->rxPtpTsData;
        handle->rxBdRing[count].rxPtpTsDataRing.front = 0;
        handle->rxBdRing[count].rxPtpTsDataRing.end = 0;
        handle->rxBdRing[count].rxPtpTsDataRing.size = buffConfig->ptpTsRxBuffNum;
        handle->txBdRing[count].txPtpTsDataRing.ptpTsData = buffConfig->txPtpTsData;
        handle->txBdRing[count].txPtpTsDataRing.front = 0;
        handle->txBdRing[count].txPtpTsDataRing.end = 0;
        handle->txBdRing[count].txPtpTsDataRing.size = buffConfig->ptpTsTxBuffNum;

        for (index = 0; index < buffConfig->rxRingLen; index++) {
            handle->rxbuffers[index] = *(buffConfig->rxBufferStartAddr + index);
        }
#endif /* ENET_PTP1588FEATURE_REQUIRED */
        /* Enable tx interrupt for use transactional API to do tx buffer free/requeue. */
        base->DMA_CH[count].DMA_CHX_INT_EN |= ENET_DMA_CH_DMA_CHX_INT_EN_TIE_MASK | ENET_DMA_CH_DMA_CHX_INT_EN_NIE_MASK;
        /* Check if the rx interrrupt is enabled. */
        rxIntEnable |= (base->DMA_CH[count].DMA_CHX_INT_EN & ENET_DMA_CH_DMA_CHX_INT_EN_RIE_MASK);
        buffConfig++;
    }

    handle->rxintEnable = rxIntEnable ? true : false;

    /* Save the handle pointer in the global variables. */
    s_ENETHandle[ENET_GetInstance(base)] = handle;

    /* Set callback and userData. */
    handle->callback = callback;
    handle->userData = userData;

    /* Enable the NVIC for tx. */
    s_enetIsr = ENET_IRQHandler;
    EnableIRQ(s_enetIrqId[ENET_GetInstance(base)]);
}

void ENET_GetMacAddr(ENET_Type *base, uint8_t *macAddr)
{
    assert(macAddr);

    uint32_t address = base->MAC_ADDR_LOW;

    /* Get from physical address lower register. */
    macAddr[2] = 0xFFU & (address >> 24U);
    macAddr[3] = 0xFFU & (address >> 16U);
    macAddr[4] = 0xFFU & (address >> 8U);
    macAddr[5] = 0xFFU & address;

    /* Get from physical address high register. */
    address = base->MAC_ADDR_HIGH;
    macAddr[0] = 0xFFU & (address >> 8U);
    macAddr[1] = 0xFFU & address;
}

void ENET_SetSMI(ENET_Type *base)
{
    uint32_t crDiv;
    uint32_t srcClock_Hz = CLOCK_GetFreq(kCLOCK_CoreSysClk) / 1000000U;

    if ((srcClock_Hz >= 20U) && (srcClock_Hz < 35)) {
        crDiv = 2;
    } else if ((srcClock_Hz >= 35) && (srcClock_Hz < 60)) {
        crDiv = 3;
    } else if ((srcClock_Hz >= 100) && (srcClock_Hz < 150)) {
        crDiv = 1;
    } else {
        crDiv = 0;
    }

    base->MAC_MDIO_ADDR = ENET_MAC_MDIO_ADDR_CR(crDiv);
}

void ENET_StartSMIWrite(ENET_Type *base, uint32_t phyAddr, uint32_t phyReg, uint32_t data)
{
    uint32_t reg = base->MAC_MDIO_ADDR & ENET_MAC_MDIO_ADDR_CR_MASK;

    /* Build MII write command. */
    base->MAC_MDIO_ADDR = reg | ENET_MAC_MDIO_ADDR_MOC(kENET_MiiWriteFrame) | ENET_MAC_MDIO_ADDR_PA(phyAddr) |
                          ENET_MAC_MDIO_ADDR_RDA(phyReg);
    base->MAC_MDIO_DATA = data;
    base->MAC_MDIO_ADDR |= ENET_MAC_MDIO_ADDR_MB_MASK;
}

void ENET_StartSMIRead(ENET_Type *base, uint32_t phyAddr, uint32_t phyReg)
{
    uint32_t reg = base->MAC_MDIO_ADDR & ENET_MAC_MDIO_ADDR_CR_MASK;

    /* Build MII read command. */
    base->MAC_MDIO_ADDR = reg | ENET_MAC_MDIO_ADDR_MOC(kENET_MiiReadFrame) | ENET_MAC_MDIO_ADDR_PA(phyAddr) |
                          ENET_MAC_MDIO_ADDR_RDA(phyReg);
    base->MAC_MDIO_ADDR |= ENET_MAC_MDIO_ADDR_MB_MASK;
}

void ENET_EnterPowerDown(ENET_Type *base, uint32_t *wakeFilter)
{
    uint8_t index;
    uint32_t *reg = wakeFilter;

