ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_LPC546XX/drivers/fsl_enet.c
status_t ENET_SendFrame(ENET_Type *base, enet_handle_t *handle, uint8_t *data, uint32_t length)
{
    assert(handle);
    assert(data);

    enet_tx_bd_ring_t *txBdRing;
    enet_tx_bd_struct_t *txDesc;
    uint8_t channel = 0;
    bool ptp1588 = false;

    if (length > 2 * ENET_TXDESCRIP_RD_BL1_MASK) {
        return kStatus_ENET_TxFrameOverLen;
    }

    /* Choose the transit queue. */
    channel = ENET_GetTxRingId(data, handle);

    /* Check if the DMA owns the descriptor. */
    txBdRing = (enet_tx_bd_ring_t *)&handle->txBdRing[channel];
    txDesc = txBdRing->txBdBase + txBdRing->txGenIdx;
    if (txBdRing->txRingLen == txBdRing->txDescUsed) {
        return kStatus_ENET_TxFrameBusy;
    }

#ifdef ENET_PTP1588FEATURE_REQUIRED
    enet_ptp_time_data_t ptpTsData;

    ptp1588 = ENET_Ptp1588ParseFrame(data, &ptpTsData, true);
#endif /* ENET_PTP1588FEATURE_REQUIRED */

    /* Fill the descriptor. */
    if (length <= ENET_TXDESCRIP_RD_BL1_MASK) {
        ENET_SetupTxDescriptor(txDesc, data, length, NULL, 0, length, true, ptp1588, kENET_FirstLastFlag, 0);
    } else {
        ENET_SetupTxDescriptor(txDesc, data, ENET_TXDESCRIP_RD_BL1_MASK, data + ENET_TXDESCRIP_RD_BL1_MASK,
                               (length - ENET_TXDESCRIP_RD_BL1_MASK), length, true, ptp1588, kENET_FirstLastFlag, 0);
    }

    /* Increase the index. */
    txBdRing->txGenIdx = ENET_IncreaseIndex(txBdRing->txGenIdx, txBdRing->txRingLen);
    /* Disable interrupt first and then enable interrupt to avoid the race condition. */
    DisableIRQ(s_enetIrqId[ENET_GetInstance(base)]);
    txBdRing->txDescUsed++;
    EnableIRQ(s_enetIrqId[ENET_GetInstance(base)]);

    /* Update the transmit tail address. */
    txDesc = txBdRing->txBdBase + txBdRing->txGenIdx;
    if (!txBdRing->txGenIdx) {
        txDesc = txBdRing->txBdBase + txBdRing->txRingLen;
    }
    base->DMA_CH[channel].DMA_CHX_TXDESC_TAIL_PTR = (uint32_t)txDesc & ~ENET_ADDR_ALIGNMENT;

    return kStatus_Success;
}

#ifdef ENET_PTP1588FEATURE_REQUIRED
void ENET_Ptp1588GetTimer(ENET_Type *base, uint64_t *second, uint32_t *nanosecond)
{
    assert(second);
    assert(nanosecond);

    uint32_t primask;

    /* Disables the interrupt. */
    primask = DisableGlobalIRQ();

    /* Get the current PTP time. */
    *second = ((uint64_t)(base->MAC_SYS_TIME_HWORD_SCND & ENET_MAC_SYS_TIME_HWORD_SCND_TSHWR_MASK) << 32U) |
              base->MAC_SYS_TIME_SCND;
    *nanosecond = base->MAC_SYS_TIME_NSCND & ENET_MAC_SYS_TIME_NSCND_TSSS_MASK;
    if (!(base->MAC_TIMESTAMP_CTRL & ENET_MAC_TIMESTAMP_CTRL_TSCTRLSSR_MASK)) {
        /* Binary rollover, the unit of the increment is ~ 0.466 ns. */
        *nanosecond = *nanosecond / 1000U * 466U;
    }

    /* Enables the interrupt. */
    EnableGlobalIRQ(primask);
}

void ENET_Ptp1588CorrectTimerInCoarse(ENET_Type *base, enet_systime_op operation, uint32_t second, uint32_t nanosecond)
{
    uint32_t corrSecond = second;
    uint32_t corrNanosecond;

    /* Set the system timer. */
    if (base->MAC_TIMESTAMP_CTRL & ENET_MAC_TIMESTAMP_CTRL_TSCTRLSSR_MASK) {
        if (operation == kENET_SystimeSubtract) {
            /* Set with the complement of the sub-second. */
            corrSecond = ENET_MAC_SYS_TIME_SCND_UPD_TSS_MASK - (second - 1);
            corrNanosecond = ENET_MAC_SYS_TIME_NSCND_UPD_ADDSUB_MASK |
                             ENET_MAC_SYS_TIME_NSCND_UPD_TSSS(ENET_NANOSECS_ONESECOND - nanosecond);
        } else {
            corrNanosecond = ENET_MAC_SYS_TIME_NSCND_UPD_TSSS(nanosecond);
        }
    } else {
        nanosecond = ENET_MAC_SYS_TIME_NSCND_UPD_TSSS_MASK / ENET_NANOSECS_ONESECOND * nanosecond;
        if (operation == kENET_SystimeSubtract) {
            /* Set with the complement of the sub-second. */
            corrSecond = ENET_MAC_SYS_TIME_SCND_UPD_TSS_MASK - (second - 1);
            corrNanosecond = ENET_MAC_SYS_TIME_NSCND_UPD_ADDSUB_MASK |
                             ENET_MAC_SYS_TIME_NSCND_UPD_TSSS(ENET_MAC_SYS_TIME_NSCND_UPD_TSSS_MASK + 1 - nanosecond);
        } else {
            corrNanosecond = ENET_MAC_SYS_TIME_NSCND_UPD_TSSS(nanosecond);
        }
    }

    base->MAC_SYS_TIME_SCND_UPD = corrSecond;
    base->MAC_SYS_TIME_NSCND_UPD = corrNanosecond;

    /* Update the timer. */
    base->MAC_TIMESTAMP_CTRL |= ENET_MAC_TIMESTAMP_CTRL_TSUPDT_MASK;
    while (base->MAC_TIMESTAMP_CTRL & ENET_MAC_TIMESTAMP_CTRL_TSUPDT_MASK)
        ;
}

status_t ENET_GetTxFrameTime(enet_handle_t *handle, enet_ptp_time_data_t *ptpTimeData)
{
    assert(handle);
    assert(ptpTimeData);

    uint32_t result = kStatus_Success;
    uint8_t count;
    uint8_t index = handle->multiQueEnable ? 2 : 1;

    for (count = 0; count < index; count++) {
        result = ENET_Ptp1588SearchTimeRing(&handle->txBdRing[count].txPtpTsDataRing, ptpTimeData);
        if (result == kStatus_Success) {
            break;
        }
    }

    return result;
}

status_t ENET_GetRxFrameTime(enet_handle_t *handle, enet_ptp_time_data_t *ptpTimeData)
{
    assert(handle);
    assert(ptpTimeData);

    uint32_t result = kStatus_Success;
    uint8_t count;
    uint8_t index = handle->multiQueEnable ? 2 : 1;

    for (count = 0; count < index; count++) {
        result = ENET_Ptp1588SearchTimeRing(&handle->rxBdRing[count].rxPtpTsDataRing, ptpTimeData);
        if (result == kStatus_Success) {
            break;
        }
    }

    return result;
}

#endif /* ENET_PTP1588FEATURE_REQUIRED */

void ENET_IRQHandler(ENET_Type *base, enet_handle_t *handle)
{
    /* Check for the interrupt source type. */
    /* DMA CHANNEL 0. */
    if (base->DMA_INTR_STAT & ENET_DMA_INTR_STAT_DC0IS_MASK) {
        uint32_t flag = base->DMA_CH[0].DMA_CHX_STAT;
        if (flag & ENET_DMA_CH_DMA_CHX_STAT_RI_MASK) {
            base->DMA_CH[0].DMA_CHX_STAT = ENET_DMA_CH_DMA_CHX_STAT_RI_MASK | ENET_DMA_CH_DMA_CHX_STAT_NIS_MASK;
            if (handle->callback) {
                handle->callback(base, handle, kENET_RxIntEvent, 0, handle->userData);
            }
        }
        if (flag & ENET_DMA_CH_DMA_CHX_STAT_TI_MASK) {
            base->DMA_CH[0].DMA_CHX_STAT = ENET_DMA_CH_DMA_CHX_STAT_TI_MASK | ENET_DMA_CH_DMA_CHX_STAT_NIS_MASK;
            ENET_ReclaimTxDescriptor(base, handle, 0);
        }
    }

    /* DMA CHANNEL 1. */
    if (base->DMA_INTR_STAT & ENET_DMA_INTR_STAT_DC1IS_MASK) {
        uint32_t flag = base->DMA_CH[1].DMA_CHX_STAT;
        if (flag & ENET_DMA_CH_DMA_CHX_STAT_RI_MASK) {
            base->DMA_CH[1].DMA_CHX_STAT = ENET_DMA_CH_DMA_CHX_STAT_RI_MASK | ENET_DMA_CH_DMA_CHX_STAT_NIS_MASK;
            if (handle->callback) {
                handle->callback(base, handle, kENET_RxIntEvent, 1, handle->userData);
            }
        }
        if (flag & ENET_DMA_CH_DMA_CHX_STAT_TI_MASK) {
            base->DMA_CH[1].DMA_CHX_STAT = ENET_DMA_CH_DMA_CHX_STAT_TI_MASK | ENET_DMA_CH_DMA_CHX_STAT_NIS_MASK;
            ENET_ReclaimTxDescriptor(base, handle, 1);
        }
    }

#ifdef ENET_PTP1588FEATURE_REQUIRED
    /* MAC TIMESTAMP. */
    if (base->DMA_INTR_STAT & ENET_DMA_INTR_STAT_MACIS_MASK) {
        if (base->MAC_INTR_STAT & ENET_MAC_INTR_STAT_TSIS_MASK) {
            if (handle->callback) {
                handle->callback(base, handle, kENET_TimeStampIntEvent, 0, handle->userData);
            }
        }
    }
#endif /* ENET_PTP1588FEATURE_REQUIRED */
}

void ETHERNET_DriverIRQHandler(void)
{
    s_enetIsr(ENET, s_ENETHandle[0]);
}
